# Getting Started with pandas

In [4]:
#import pandas as pd
from pandas import Series, DataFrame

In [8]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
obj2 = pd.Series([4,7,-5,3], index=['c','d','a','b'])
for i in obj2.index:
    print(i, obj2[i])

c 4
d 7
a -5
b 3

In [26]:
obj2['c']

4

In [30]:
obj2[['d','a']]

d    7
a   -5
dtype: int64

In [32]:
obj2[obj2>=4]

c    4
d    7
dtype: int64

In [34]:
obj2 * 2

c     8
d    14
a   -10
b     6
dtype: int64

In [40]:
import numpy as np
np.exp(obj2)

c      54.598150
d    1096.633158
a       0.006738
b      20.085537
dtype: float64

In [39]:
kk = np.exp(obj2)
print(type(kk))

<class 'pandas.core.series.Series'>

In [41]:
'd' in obj2

True

In [49]:
sdata= {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [52]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [54]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [55]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [56]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [57]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [61]:
obj4.name = 'City'
obj4.index.name = 'Population'

In [62]:
obj4

Population
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: City, dtype: float64

In [71]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [73]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [74]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [76]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [78]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [82]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2